Revit 2024 API
IndependentTag Class
 Represents tag annotations in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class IndependentTag : Element
Visual Basic
Public Class IndependentTag _
	Inherits Element
Visual C++
public ref class IndependentTag : public Element
Remarks
 IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags. IndependentTag is also the base class for other annotations like keynote tags and span symbols. Room, area and space tags are not derived from IndependentTag. SpatialElementTag for more information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.FabricReinSpanSymbol
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
 Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol
See Also
IndependentTag Members
Autodesk.Revit.DB Namespace